{
  "basics": {
    "name": "Alaf Azam Khan",
    "titles": ["Senior Product Manager", "Engineering Leader", "AI + E-commerce", "Product Leader @ Increff"],
    "email": "alafazam@gmail.com",
    "phone": "+917987847247",
    "linkedin": "https://www.linkedin.com/in/alafazam/",
    "linkedinDescription": "linkedin.com/in/alafazam | Sr. PM | AI | E-commerce",
    "avatarUrl": "/avatar.jpg",
    "resumePdfUrl": "/assets/Alaf SPM Resume October 2025.pdf"
  },
  "summary": "AI-driven Product Leader with a strong technical foundation (ex-SDE3) and 8+ years building and scaling SaaS platforms across complex domains like Warehouse Management, Order Management, and Supply Chain. Experienced in driving 0→1 innovation and 1→10 growth, leading cross-functional teams to ship high-impact, data-informed products. Passionate about leveraging AI and automation to accelerate product development, enhance decision-making, and unlock scalable business outcomes.",
  "coreAchievements": [
    {
      "icon": "🚀",
      "title": "Platform Architecture",
      "description": "Designed database structures with optimized indexing and continuous performance monitoring for OMS/WMS solutions, enabling the platform to efficiently manage 200M+ SKUs and process 8M+ orders monthly while maintaining sub-second API response times."
    },
    {
      "icon": "🤖",
      "title": "AI Implementation",
      "description": "Accelerated product delivery by implementing AI-powered prototyping, replacing Figma with code-based prototypes using Cursor. This provided developers with ready-to-implement UI code for 30-40 screens, reducing feature delivery time from quarterly to monthly cycles."
    },
    {
      "icon": "💰",
      "title": "Revenue Growth",
      "description": "Grew company from pre-revenue to $12M+ ARR by developing flexible retail tech solutions addressing critical supply chain pain points, while collaborating with sales on pricing models and GTM strategies."
    }
  ],
  "experience": [
    {
      "title": "Senior Technical Product Manager | Prodcut Head",
      "company": "Increff",
      "period": "March 2022 — Present",
      "teamInfo": "Team: 25 | PMs Managed: 3 | Products: 6+ | Reported to: CEO",
      "scope": "AI-driven Product Leader who established and scaled the Product Management function at Increff. Defined the product vision and roadmap for a suite of 6+ SaaS products — including WMS, OMS, SFS, Omnichannel Fulfillment, LMS, and BI systems — serving 100+ retail clients (~$10M ARR). Championed the integration of AI and data intelligence across product lines to drive automation, predictive insights, and operational scalability.",
      "techStack": ["Spring", "Python", "MySQL", "GCP", "Kubernetes", "Angular"],
      "productTools": ["Jira", "Figma", "Notion", "Matomo"],
      "achievements": [
        "Established and scaled the Product Management function at Increff, driving product vision, roadmap alignment, and cross-functional delivery across a $12M ARR SaaS suite spanning WMS, OMS, SFS, and analytics products.",
        "Spearheaded the end-to-end vision and execution of WMS2, Increff's next-generation warehouse management platform—leading a strategic architectural shift from serialized to non-serialized workflows, unlocking new regional GTMs and expanding addressable market.",
        "Implemented an AI-first culture across product workflows, deploying custom AI copilots for PRD creation and UI prototyping (via Cursor), cutting prototyping time by 50% and accelerating design-to-code delivery by ~70–80%.",
        "Led strategic client implementations for enterprise retailers (Meesho, Al-Abdul Karim, ModeInk), driving ₹3M+ MRR through end-to-end solutioning, implementation planning, and C-level negotiation support.",
        "Redesigned sprint planning using data-driven bandwidth allocation (e.g., 41% onboarding, 39% bugs, 12% architecture), improving on-time delivery from 60% → 85% and cutting critical unplanned requests by 80%.",
        "Introduced a ROA-driven (Return on Attention) prioritization framework, aligning Sales, Success, and Engineering on unified focus areas—eliminating urgent-critical feature asks and improving roadmap predictability.",
        "Championed AI-powered PM and engineering efficiency, integrating prompt libraries, prototyping assistants, and automated documentation into core workflows to institutionalize AI use in product operations.",
        "Hired and mentored 3 APMs into independent PMs, scaling the product organization to manage 6+ products autonomously and improving PM-to-engineering throughput across teams.",
        "Led cost optimization initiatives, streamlining cloud infrastructure and eliminating redundant services worth ₹1M annually, maintaining 99.9% uptime while supporting 8M+ monthly orders.",
        "Established pre-sales and onboarding teams from scratch, defining processes and success metrics to ensure predictable, scalable enterprise client go-lives.",
        "Modernized product delivery and process governance, implementing data-backed decision frameworks and sprint hygiene practices that improved team velocity, transparency, and leadership visibility.",
        "Standardized product hiring and evaluation frameworks, conducting 60+ PM and technical interviews and improving hiring velocity by 25%."
      ],
      "achievementCategories": [
        "🏗️ Organization Building",
        "🚀 Strategic Innovation",
        "🤖 AI Leadership",
        "💰 Revenue Generation",
        "📊 Process Optimization",
        "🎯 Strategic Framework",
        "⚡ AI Efficiency",
        "👥 Team Development",
        "💵 Cost Optimization",
        "🎯 Organization Building",
        "📈 Process Governance",
        "🎤 Hiring Excellence"
      ],
      "modalDetails": {
        "roleOverview": "",
        "revenueAndGrowth": [
          "Led strategic client implementations generating <strong>₹30+ lakh monthly recurring revenue</strong> (Meesho: ₹10L/month, Al-Abdul Karim: ₹10L/month, ModeInk: ₹10L/month), including complex 4-5x enterprise retail onboarding processes",
          "Spearheaded <strong>cost optimization initiatives</strong> across cloud infrastructure, identifying and eliminating redundant services worth $500K+ annually, achieving 15% reduction in cloud spend",
          "Grew company from pre-revenue to <strong>$12M+ ARR</strong> through flexible retail tech solutions addressing critical supply chain pain points"
        ],
        "productInnovation": [
          "Championed <strong>WMS2 strategic pivot</strong> from serialized to non-serialized warehouse management platform, revolutionizing Increff's architecture to unlock significant TAM expansion and enabling US market entry with 3 major opportunities secured within 1 month",
          "Implemented <strong>AI-first culture across PM workflows</strong> using Cursor and custom AI copilots with 150+ curated prompts, achieving 50% reduction in prototyping time and 70-80% faster UI development",
          "Designed database structures with optimized indexing and continuous performance monitoring, enabling platform to handle <strong>200M+ SKUs and 8M+ monthly orders</strong> with sub-second API response times"
        ],
        "teamLeadership": [
          "Established the <strong>product management function from ground zero</strong>, implementing prioritization frameworks and cross-functional processes resulting in roadmap stability and 40% reduction in PM-to-developer handoff friction",
          "Hired and developed <strong>3 Associate Product Managers</strong> over 2 years, growing them into independent PMs managing their own product lines and stakeholder relationships",
          "Established <strong>pre-sales and customer onboarding teams</strong> from scratch, including hiring, defining responsibilities, SOPs and performance expectations"
        ],
        "processOptimization": [
          "Implemented a <strong>structured, ROA-driven prioritization (Return on Attention) framework</strong>—merging, deferring, and ranking cross-functional feature asks via a unified master sheet—reducing urgent-critical requests from 3–4 per sprint to zero and aligning all teams on shared strategic focus",
          "Redesigned sprint planning with <strong>structured bandwidth allocation</strong> (41% onboarding, 39% bugs, 12% architecture), improving on-time delivery from 60% to 85% and reducing urgent requests by 80%",
          "Standardized <strong>technical interview process</strong> across APM, PM, PM2, SDE1-3 roles, conducting 50+ tech interviews and 15+ PM interviews, improving hiring quality while reducing time-to-offer by 25%"
        ],
        "technicalExecution": [
          "Modernized product suite with <strong>Kubernetes-based auto-scaling deployment architecture</strong>, implementing zero-downtime deployments and independent microservice scaling",
          "Spearheaded transition of 25+ developers from siloed UI/Backend teams to <strong>full-stack engineering pods</strong>, eliminating cross-team dependencies and reducing delivery time by 10%",
          "Personally delivered <strong>45+ story points of critical development work</strong> during high-attrition periods, directly unblocking high-value clients while managing concurrent product initiatives"
        ]
      }
    },
    {
      "title": "Software Development Engineer 3 / Acting Technical Product Manager",
      "company": "Increff",
      "period": "June 2021 — March 2022",
      "teamInfo": "Team: 15–20 | Reported to: CTO",
      "description": "Engineering Leader for entire fulfillment suite of products that has Warehouse, Order and Store management systems. Responseble for ideations, prioritization, roadmap, and delivery of the products. Later established the product management function at Increff.",
      "techStack": ["Spring", "Hibernate", "MySQL", "GCP", "ELK", "Technical Recruiting", "Analytical Skills", "Architecture Design", "Code Refactoring", "E-Commerce", "Problem Solving", "Code Review", "College Recruiting", "Java", "Solution Architecture", "System Architecture", "Hiring", "Coaching & Mentoring"],
      "achievements": [
        "<strong>Architected complex feature suite</strong> including Order Splitting, Async Inventory allocation, Virtual Combos, and Expiry Workflows that increased inventory utilization and <strong>unlocked significant TAM expansion</strong> for Increff, resulting in new clients and increased order volumes.",
        "Built the <strong>foundational versions</strong> of Increff's Order Management System (OMS) and Store Fulfillment System (SFS) as independently sellable products, now used by <strong>50+ and 10+ clients</strong> respectively.",
        "During covid crisis, <strong>joined sales efforts</strong> to help demonstrate product capabilities and support closing critical deals during challenging market conditions.",
        "Developed <strong>specialized demo tool</strong> for sales team that eliminated scanning data management issues, reducing demo errors by 50% and accelerating conversion rates.",
        "Facilitated <strong>structured agile ceremonies</strong> including daily standups, weekly prioritization, support issue meetings, and architectural discussions, ensuring smooth sprint execution and delivery.",
        "Revamped <strong>SDLC processes</strong> that increased sprint velocity by 10% through improved planning methods while creating greater visibility across engineering teams.",
        "Conducted <strong>30+ enterprise client interviews</strong> to identify pain points and growth opportunities, synthesizing findings into a comprehensive strategic roadmap.",
        "Successfully <strong>transitioned from engineering to product management</strong>, establishing requirements frameworks and prioritization processes that improved delivery predictability by 15%."
      ]
    },
    {
      "title": "Software Development Engineer 2",
      "company": "Increff",
      "period": "July 2019 — June 2021 • 2 years",
      "teamInfo": "Team Size: 5-10 | Managed: 3-5 | Reported to: CTO",
      "techStack": ["Spring", "Hibernate", "MySQL", "GCP", "ELK", "Technical Recruiting", "Analytical Skills", "Architecture Design", "Code Refactoring", "E-Commerce", "Problem Solving", "Code Review", "College Recruiting", "Java", "Solution Architecture", "System Architecture", "Hiring", "Coaching & Mentoring"],
      "description": "Team Lead for Warehouse and Order Management System (WMS & OMS) Product. Led architecture design, system design, coding standards, product delivery, and technical documentation.",
      "achievements": [
        "<strong>Architected</strong> and implemented inventory tracking system that maintained <strong>99.9% accuracy</strong> across <strong>millions of SKUs</strong>, becoming a <strong>key selling point</strong> for enterprise clients.",
        "<strong>Owned the design and implementation</strong> of complex Order Management System (OMS) features, including multi channel inventory updates, buffer inventory, <strong>ERP integration framework</strong>, <strong>Logistics Integration framework</strong>.",
        "Ensured <strong>Test Driven Development (TDD)</strong> and <strong>Code Coverage (90%)</strong> with over <strong>1000+ unit tests</strong> for all the code written in my modules.",
        "<strong>Designed database schema and API endpoints</strong> for WMS core modules (gate entry, receiving, cycle counting, audit, b2b packing), ensuring <strong>scalability from thousands to millions</strong> of daily transactions.",
        "Created <strong>comprehensive technical documentation</strong> and coding standards that <strong>reduced onboarding time</strong> for new developers from <strong>4 weeks to 2 weeks</strong>.",
        "<strong>Led technical implementations for 10+ key clients</strong> from pre-sales through production launch, customizing solutions for specific warehouse configurations while <strong>maintaining core codebase integrity</strong>.",
        "Actively involved in <strong>campus recruitment initiatives</strong>, representing the company at approximately <strong>10 universities</strong> to identify and attract top talent."
      ],
      "isCollapsible": true
    },
    {
      "title": "Software Development Engineer 1",
      "company": "Increff",
      "period": "June 2017 — February 2019 • 1 year 9 months",
      "teamInfo": "Team Size: 3-5 | Reported to: CTO",
      "techStack": ["Java", "Spring", "Hibernate", "MySQL", "GCP", "E-Commerce", "Problem Solving"],
      "description": "Part of the Warehouse and Order Management System (WMS & OMS) product team, actively involved in the full software development lifecycle from design to development to deployment and to onboarding new clients.",
      "achievements": [
        "As an <strong>Engineer</strong>, contributed to the <strong>development of the core Order Management System (OMS)</strong> solution, gaining hands-on experience with <strong>Java</strong> and <strong>scalable system design</strong>.",
        "<strong>Owned the implementation</strong> of multiple Increff services like <strong>MDM</strong> / <strong>Inventory Management</strong>, <strong>OMS</strong>, <strong>Channel Integration Management</strong>, etc.",
        "Actively participated in the full <strong>SDLC</strong>, learning through <strong>practical application</strong> and <strong>iterative development</strong>.",
        "<strong>Contributed to team efforts</strong> in setting up the <strong>testing framework</strong> and rallying team for taking <strong>code coverage to 90%</strong>, gaining exposure to collaborative development workflows.",
        "Gained initial experience in writing <strong>microservices</strong>, <strong>deployments</strong>, <strong>optimising DB queries</strong>, <strong>debugging</strong> with a focus on continuous learning and improvement.",
        "<strong>Independently identified and resolved all production issues</strong> for my assigned modules, demonstrating strong <strong>problem-solving</strong> abilities."
      ],
      "isCollapsible": true
    },
    {
      "title": "Software Development Engineer",
      "company": "Envestnet Yodlee",
      "period": "July 2016 — September 2017",
      "techStack": ["Node.js", "SQL", "Express.js", "Handlebar.js", "Backbone.js", "Java", "Spring", "Hibernate"],
      "description": "Part of sustaining engineering team in Yodlee. Fixed bugs in existing product (Personal Finance Manager) and developed an internal tool that tracks Bugzilla productivity using XML RPC API.",
      "achievements": [
        "Developed internal productivity tracking tool using XML RPC API that improved team metrics visibility and increased bug resolution rate by 15%",
        "Fixed critical bugs in the Personal Finance Manager product, improving customer satisfaction scores by 12%"
      ],
      "isCollapsible": true
    }
  ],
  "education": [
    {
      "institution": "National Institute of Technology Srinagar",
      "degree": "Bachelors in Information Technology",
      "period": "2012 — 2016",
      "gpa": "8.0/10"
    }
  ],
  "certifications": [
    {
      "platform": "maven",
      "title": "Improving Your Product Sense",
      "issueDate": "Sep 2024",
      "credentialId": "XqbJfSva",
      "url": "https://maven.com/certificate/XqbJfSva"
    },
    {
      "platform": "maven",
      "title": "Managing your PM Career in 2025 and beyond",
      "issueDate": "Jul 2024",
      "credentialId": "VbVjjhlx",
      "url": "https://maven.com/certificate/VbVjjhlx"
    },
    {
      "platform": "edx",
      "group": "Supply Chain Specialization",
      "items": [
        {
          "title": "Supply Chain Dynamics",
          "issueDate": "Dec 2021",
          "credentialId": "2e1a26ab7c9c461db153d48acf5bc6db",
          "url": "https://courses.edx.org/certificates/2e1a26ab7c9c461db153d48acf5bc6db"
        },
        {
          "title": "Supply Chain Design",
          "issueDate": "Apr 2021",
          "credentialId": "ea7763df63b748769dd3f306f29eb4b0",
          "url": "https://courses.edx.org/certificates/ea7763df63b748769dd3f306f29eb4b0"
        },
        {
          "title": "Supply Chain Fundamentals",
          "issueDate": "Dec 2020",
          "credentialId": "0914c7fd78254817a8021a06c42790f2",
          "url": "https://courses.edx.org/certificates/0914c7fd78254817a8021a06c42790f2"
        },
        {
          "title": "Supply Chain Technology and Systems",
          "issueDate": "Mar 2021",
          "credentialId": "6d9c3e4cb61c41f380946ab383c9c416",
          "url": "https://courses.edx.org/certificates/6d9c3e4cb61c41f380946ab383c9c416"
        }
      ]
    }
  ]
} 